{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 64, 64, 3], "function_type": "lambda", "trainable": true, "name": "lambda_1", "dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0010\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018d\u0003\u0000\u0014S)\u0004Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00e9\u0002\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa=G:/Documents/GITHUB/!Vehicle_detection_and_tracking/model3.py\u00da\b<lambda>\u0015\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape_type": "raw", "output_shape": null}}, {"class_name": "Conv2D", "config": {"batch_input_shape": [null, 64, 64, 3], "use_bias": true, "name": "conv2d_1", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "filters": 16, "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "strides": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "filters": 32, "bias_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "strides": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "filters": 32, "bias_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "strides": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_3", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "units": 500}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_2", "units": 100}}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "softmax", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_3", "units": 2}}], "keras_version": "2.0.6", "backend": "tensorflow"}